Revit 2026 API

# SlabShapeEditorAddPoint Method

---

Add a point to the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SlabShapeVertex AddPoint(
	XYZ point
)
```
```vb
Public Function AddPoint (
	point As XYZ
) As SlabShapeVertex
```
```cpp
public:
SlabShapeVertex^ AddPoint(
	XYZ^ point
)
```
```fsharp
member AddPoint :
        point : XYZ -> SlabShapeVertex
```

#### Parameters

point XYZ

#### Return Value

SlabShapeVertex the newly added slab shape vertex.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The newly added point should be inside the element boundary on the x-y plane. SlabShapeEditor must be enabled before calling this method. Regenerate the document after element creation if this method is called in the same transaction.

#### Reference

SlabShapeEditor Class

Autodesk.Revit.DB Namespace